Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/leaving_ireland/leaving_ireland_and_your_social_security_entitlements.html.txt.tmx
Source language: en
Languages: ga

source: Leaving Ireland and your social security entitlements
ga: Do chearta leasa shóisialta agus tú ag fágáil Éireann

source: • Countries covered by EU Regulations
ga: • Tíortha clúdaithe ag Rialacha an AE

source: Every year, thousands of citizens leave Ireland to work, travel, study or retire abroad
ga: Fágann na mílte saoránach Éire gach bliain chun obair a fháil, chun taisteal nó chun dul ar phinsean thar lear

source: Some people leave Ireland to work or study for a short period (that is, a few months), other people go abroad for longer
ga: Fágann roinnt daoine Éire chun obair a fháil, nó staidéar a dhéanamh le haghaidh tréimhse giorra (is é sin, le haghaidh roinnt míonna), téann daoine eile thar lear le haghaidh tréimse níos faide

source: Many others who have been living, studying or working in Ireland also leave to return to their home countries
ga: Ímionn go leor daoine eile a bhíodh ina gcónaí, ag staidéar, nó fostaithe in Éirinn chomh maith chun dul ar ais go dtí a dtíortha dúchasacha

source: If you leave Ireland to live and/or work in another country, you may be entitled to receive social security benefits in the country you are moving to
ga: Tá sé tábhachtach, mar sin, a fhios a bheith agat go dtarlódh go mbeidh ceart agat chun sochair leasa shóisialta a fháil i dtír eile má fhágann tú Éire chun chónaí agus/nó chun obair a fháil sa tír sin

source: You can find information about it in our document on social security arrangements that Ireland has with other countries
ga: Tá tuilleadh eolais faoi na socruithe atá i bhfeidhm idir Éire agus tíortha eile

source: Some Irish social welfare payments can be paid abroad – you can read more in our document on going abroad and social welfare payments
ga: D’fhéadfadh go n-íocfar íocaíochtaí leasa shóisialaigh áirithe thar lear – léigh tuilleadh inár ndoiciméad faoi ag dul thar lear agus íocaíochtaí leasa shóisialaigh

source: Countries covered by EU Regulations
ga: Tíortha clúdaithe ag Rialacha an AE

source: If you move to live or work in a country covered by EU Regulations, this means that for social security benefits or services, you are entitled to be treated in the same way as the nationals in the EU member state or EEA country that you move to
ga: Má bhogann tú chun cónaí i dtír atá clúdaithe ag Rialacha an AE, ciallaíonn sé sin go bhfuil tú i dteideal go gcaitear leat ar an mbealach céanna leis na náisiúnaigh sa bhallstáit an AE nó sa tír LEE a mbogann tú chuige, ó thaobh sochair nó seirbhísí leasa shóisialta de

source: On a practical level, this means that you and your family are entitled to apply for any benefits or assistance available in the country in which you reside
ga: I ngníomh, ciallaíonn sé sin go bhfuil tú agus do theaghlach i dteideal iarratas a dhéanamh ar shochair nó ar chúnamh ar bith atá ar fáil sa tír ina bhfuil tú i do chónaí

source: If you are applying for insurance-based payments, any contributions made in other EU member states or EEA countries should be taken into account
ga: Má tá tú ag déanamh iarratais ar íocaíochtaí bunaithe ar árachas, ba cheart go gcuirfear san áireamh ranníocaíochtaí ar bith atá déanta agat i mballstáit AE nó i dtíortha LEE eile

source: Social insurance contribution record
ga: Do thaifead árachais shóisialta

source: If you need to claim benefits while living abroad you will be asked to provide information about your Irish social insurance record
ga: Má tá tú i do chónaí thar lear agus más gá duit sochair a éilimh, iarrfar ort faisnéis maidir le do thaifead árachas sóisialaigh Éireannach a sholáthar

source: You can use forms E104 and U1 (formerly E301) when claiming sickness, maternity or unemployment benefits abroad - see 'How to apply' below
ga: Is féidir foirmeacha E104 agus U1 (E301 roimhe seo) a úsáid chun sochair thinnis, máithreachais nó dífhostaíochta a éileamh thar lear - féach 'Conas iarratas a dhéanamh' thios

source: The U1 is called a portable document and it provides details of your Irish social insurance record
ga: Tugtar doiciméad iniompartha mar ainm ar an U1 agus tugann sé sonraí maidir le do thaifead árachais shóisialta in Éirinn

source: If you don’t bring your E104 or U1 with you, the country you have moved to will contact Irish authorities to get a record of your insurance contributions when you apply to them for unemployment, sickness or maternity benefits
ga: Mura dtugann tú d’fhoirmeacha E104 nó U1 leat, déanfaidh an tír ar bhog tú chuici teagmháil le h-údaráis na hÉireann chun taifead de do stampaí árachais a fháil nuair a dhéanfaidh tú iarratas chucu ar shochair dhífhostaíochta, bhreoiteachta nó mháithreachais

source: A request from another EU member state for your social insurance record will be prioritised by the Department of Social Protection so that you don’t lose out on any benefits due to you when abroad
ga: Tabharfaidh an Roinn Coimirce Sóisialaí tús áite d’iarratas ó bhallstát eile de chuid an AE ar thaifead árachais shóisialta ionas nach gcaillfidh tú aon sochair atá ag dul duit nuair atá tú thar lear

source: If you are returning to Ireland from a country in the EU or EEA, you should bring an E104 and U1 form back with you as they will provide details of the insurance contributions you made in that country
ga: Nuair a thagann tú ar ais go hÉirinn as tír san AE/LEE, ba cheart duit na foirmeacha U1 agus E104 seo a thabhairt leat mar go mbeidh sonraí na ranníocaíochtaí a rinne tú sa tír sin orthu

source: The forms are presented at the relevant social security agency of the country you are living in when you are making a claim
ga: Tugtar na foirmeacha don ghníomhaireacht leasa shóisialta chuí sa tír ina bhfuil tú i do chónaí agus tú ag déanamh éilimh

source: A request for an E104 or U1 by another EU member state is always prioritised by the Department of Social Protection
ga: Tugann an Roinn Coimirce Sóisialaí tús áite i gcónaí d’iarratas ar E104 nó U1 ó bhallstát eile de chuid an AE

source: This is because a person who is unemployed or sick abroad has made a claim for benefit and it must be dealt with as quickly as possible
ga: Déantar é seo toisc go bhfuil éileamh ar shochar déanta ag duine atá dífhostaithe nó tinn thar lear agus caithfear déileáil leis a luaithe agus is féidir

source: If you want to bring your E104 and U1 with you, you can request your Irish social insurance record for E104 and U1 (pdf) before leaving
ga: Más mian leat do U1 nó E104 a thabhairt leat, féadfaidh tú do thaifead árachais shóisialta Éireannach do E104 agus U1 a iarraidh (pdf) roimh fágála

source: Processing your application can take some time as the DSP may have to contact your recent employer/s before the E104 and U1 forms can be issued
ga: D'fhéadfadh sé roinnt ama a thógáil d’iarratas a phróiseáil mar beidh ar an Roinn Coimirce Sóisialaí teagmháil a dhéanamh le d’iarfhostóir sula bhféadfar na foirmeacha E104 agus U1 a eisiúint

source: You should send the completed application form to the International Records Section of the Department of Social Protection - see 'Where to apply' below
ga: Ba chóir duit an fhoirm iarratais chomhlánaithe a sheoladh chuig Rannóg na dTaifead Idirnáisiúnta de chuid na Roinne Coimirce Sóisialaí - féach 'Cá háit a ndéanfaidh mé iarratas

source: With your application, you must include a copy of your P45, a copy of your P60 and remember to include your address abroad
ga: Ní mór duit cóip de do P45 agus de do P60 a chur le d’iarratas agus ná déan dearmad do sheoladh thar lear
